/* Задача 2. Напишите программу, которая на вход принимает два числа и выдаёт,
какое число большее, а какое меньшее */

Console.Clear();

// Console.Write("Введите первое число: ");
// int number1 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите второе  число: ");
// int number2 = Convert.ToInt32(Console.ReadLine());

// if (number1 != number2)
// if (number1 > number2)
// {
//   Console.WriteLine("Первое число больше");  
//   Console.WriteLine("Второе число меньше");
// }
// else
// {
//   Console.WriteLine("Первое число меньше");  
//   Console.WriteLine("Второе число больше");  
// }
// else
// {
//   Console.WriteLine("Два числа равны");
// }

/* Задача 4. Напишите программу, которая принимает на вход три числа и выдаёт максимальное
из этих чисел. */

// Console.Write("Введите первое число: ");
// int number1 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите второе число: ");
// int number2 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите третье число: ");
// int number3 = Convert.ToInt32(Console.ReadLine());

// int max = 0;
// if (number1 > number2)
// {
//     max = number1;
// }
// else
// {
//     max = number2; 
// }
// if (max > number3)
// {
//     max = max;
// }
// else
// {
//     max = number3; 
// }
// Console.WriteLine("Максимальное число: " + max);
